h2_convert = {
    #关系
    '友好城市':['友好城市','姐妹城市','姊妹、友好城市','姊妹城市',
    '姊妹、友好都市','姊妹市友好都市','姊妹都市','姊妹市'],
    #属性
    '简介':['简介','概要','概况'],
    '历史':['历史','历史沿革','沿革'],
    '交通':['交通','交通运输'],
    '经济':['经济','财政收入','产业','资源','物产','工业'],
    '人口':['人口','人口统计','文化教育','居民'],
    '教育':['教育'],
    '政治':['政治','对外交流','国际关系','政府','国际交流','城市荣誉'],
    '文化':['文化','宗教','语言','全国重点文物保护单位','饮食','风土人情'],
    '旅游':['旅游','观光资源','观光','景点','风景名胜','名胜','名胜古迹',
    '观光景点','旅游景点','文化和旅游'],
    '地理':['气候','地理与气候','自然地理','地理位置','地理概况'],
    '社会':['社会','社会事务','医疗','公共设施'],
    '体育':['体育','运动'],
    #无效主题
    '无效主题':['行政区划','名人','来源','特产','地域','阅读','地名',
    '人物','媒体','其他','词源','由来','民族','学校','图','人士',
    '作品','立法','今日','参见','注释','国政','译名','院校','传媒']
}

useless = ['行政区划','名人','来源',
'特产','地域','阅读','地名','人物',
'媒体','其他','词源',
'由来','民族','学校','图','人士','作品','立法',
'今日','参见','注释','国政','译名','院校','传媒']

# give some link that is not linked to the city
error_city = ['加拿大\\多芬','乌干达\\卡巴莱']

# cities that may miss some important information
miss_city = ['中国\\武汉市']