# format: link_type{ul|tbody}
# ul,ul_start_index,ul_en_index
# tbody,tbody_index,tr_start,td_start

# 需要检查的问题：npy中无法编码Python None对象，需要重新改写(x)
# 或在读取时设定 allow_pickle = True(记得在再次读取时批量修改即可)
city_record = {
    #latin America
    '智利':['tbody',0,2,0],
    '巴西':['tbody',0,1,0],
    '尼加拉瓜':['tbody',3,1,0],
    '巴哈马':['tbody',1,1,0],
    '巴拉圭':['tbody',0,2,0],
    '乌拉圭':['tbody',0,1,0],
    '安提瓜和巴布达':['ul',0,1],
    #European
    '英国':['tbody',1,1,0],
    '挪威':['ul',1,2],
    '瑞典':['tbody',0,1,0],
    '冰岛':['tbody',0,1,0],
    '芬兰':['tbody',0,1,0],
    '德国':['dl',0,73], #dl-dd (normal ul-li)
    '奥地利':['tbody',0,1,0],
    '斯洛伐克':['tbody',0,1,0],
    '意大利':['tbody',0,1,0],
    '希腊':['tbody',0,1,1,1], #考虑不含超链接的词条
    '波兰':['tbody',0,1,2],
    '罗马尼亚':['tbody',1,1,0],
    '乌克兰':['tbody',0,1,0],
    '阿尔巴尼亚':['ol',0,3],
    '爱尔兰':['tbody',0,1,0], # specific format: tbody tr th|td
    '俄罗斯':['tbody',0,1,0],
    '保加利亚':['tbody',0,1,2], # 
    '匈牙利':['tbody',0,1,0], #第一项a对应的是图片
    '荷兰':['tbody',0,1,0],
    '比利时':['tbody',1,1,0],
    '卢森堡':['tbody',0,1,1],
    '葡萄牙':['tbody',0,1,1],
    '法国':['tbody',0,1,0],
    '丹麦':['tbody',0,1,0],
    '西班牙':['tbody',0,1,0],
    '塞尔维亚':['ul',0,1],
    '斯洛文尼亚':['ul',0,1],
    '白俄罗斯':'特殊处理',
    '克罗地亚':['ul',0,3],
    '波斯尼亚和黑塞哥维那':['ul',0,4],
    '摩尔多瓦':['ul',1,23], #考虑不含超链接的词条
    '捷克':['tbody',0,1,0],
    '爱沙尼亚':['tbody',0,1,0],
    '拉脱维亚':['tbody',0,1,0],
    '黑山':['tbody',1,1,0],
    '立陶宛':['tbody',0,1,2],
    '塞浦路斯':['tbody',0,1,0],
    #Asian
    '土耳其':['tbody',0,1,0],
    '阿塞拜疆':['ul',1,2],
    '亚美尼亚':['tbody',0,1,0],
    '格鲁吉亚':['tbody',0,1,0],
    '阿曼':['tbody',1,1,0],
    '沙特阿拉伯':['tbody',0,1,0],
    '阿联酋':['tbody',0,1,0],
    '伊拉克':['tbody',0,1,0],
    '伊朗':['ul',1,23],
    '叙利亚':['tbody',0,1,0],
    '黎巴嫩':['tbody',0,1,0],
    '以色列':['tbody',0,1,0],
    '巴勒斯坦':None, #政治问题暂不考虑
    '也门':['tbody',0,2,1],
    '印度':'特殊处理-读取多个表格并合并结果',
    '巴基斯坦':['tbody',1,2,1],
    '缅甸':['tbody',1,1,1],
    '阿富汗':['tbody',0,1,0],
    '泰国':['tbody',3,1,0],
    '尼泊尔':['tbody',1,1,0],
    '不丹':['ul',0,1],
    '柬埔寨':['ul',0,1],
    '马来西亚':['tbody',0,3,0],
    '孟加拉国':['tbody',1,1,0],
    '中华人民共和国':None, #已经完成与台湾省数据的合并
    '朝鲜':['tbody',3,1,0],
    '韩国':'特殊处理-读取多个表格并合并结果',
    '日本':'特殊处理-读取多个表格并合并结果',
    '蒙古':['tbody',0,1,0],#最后一行为国家网页，需要排除
    '老挝':['tbody',0,2,0],
    '印度尼西亚':['tbody',0,1,0],
    '菲律宾':['tbody',3,1,0],
    '斯里兰卡':['tbody',0,1,0], #特殊对待 部分词条无超链接
    '越南':'特殊处理-读取多个表格并合并结果',
    '土库曼斯坦':['tbody',0,1,1,1], #部分词条无超链接 + 城市词条不位于第一列
    '哈萨克斯坦':['tbody',0,1,1,1],
    '乌兹别克斯坦':['tbody',0,1,1,1], #只截取了人口前20的城市
    '塔吉克斯坦':['tbody',0,1,1,1], #部分词条无超链接 + 城市词条不位于第一列
    '吉尔吉斯斯坦':['tbody',0,1,0,0], #部分词条无超链接
    '文莱':None, #仅记录了斯里巴加湾
    '澳大利亚':['ul',1,11],
    #African
    '突尼斯':['tbody',0,1,0,0],
    '摩洛哥':['tbody',0,1,1,0],
    '乌干达':['tbody',0,1,1,0],
    '安哥拉':['tbody',0,1,1,0],
    '津巴布韦':['tbody',0,3,1,0],
    '吉布提':['tbody',0,3,1,0],
    '博茨瓦纳':['tbody',0,1,1,0],
    '莫桑比克':['ul',0,1],
    '赞比亚':['tbody',0,3,1,0],
    '冈比亚':['ul',0,1],
    '阿尔及利亚':['tbody',0,2,1,0],
    '加纳':['ul',0,1],
    '莱索托':['tbody',0,3,1,0],
    '马拉维':['ul',0,3],
    '多哥':['ul',0,1],
    '尼日尔':['ul',0,1],
    '尼日利亚':['ul',0,1], #含待消除歧义的网址
    '利比里亚':['ul',0,1], 
    '埃及':['tbody',0,1,1,0],
    '贝宁':['ul',0,1],
    '加蓬':None, #处理完毕，拼接了tbody部分和ul部分的内容 ['tbody',1,1,0,'ul',0,10]
    '坦桑尼亚':['ul',0,1],
    '肯尼亚':['ul',1,9],
    '刚果共和国':['ul',0,1],
    '刚果民主共和国':['tbody',5,1,0,0],
    '厄立特里亚':['tbody',0,3,1,0],
    '纳米比亚':['ul',0,1],
    '利比亚':['tbody',0,1,1,0],
    '喀麦隆':['tbody',0,1,1,0],
    '布基纳法索':['ul',0,1],
    '埃塞俄比亚':['tbody',0,2,1,0],#处理完毕['tbody',1,1,0,'ul',2,3]
    '马达加斯加':['tbody',0,1,1,0],
    '卢旺达':['ul',0,1],
    '科特迪瓦':['ul',0,1],
    '南非':['tbody',1,1,3,0], #使用自治市首府代替信息较少的自治市
    '毛里塔尼亚':['tbody',0,3,1,1], #version 2
    '苏丹':['ul',0,1],
    '南苏丹':['tbody',0,1,0,0],
    '佛得角':['tbody',0,1,1,0]  #待查证
}

zhongliangji = {
    #城市数量远超想象？
    '德国':'https://zh.wikipedia.org/zh-cn/%E5%BE%B7%E5%9B%BD%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #tbody 部分城市没有超链接
    '希腊':'https://zh.wikipedia.org/zh-cn/%E5%B8%8C%E8%85%8A%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #部分城市被俄罗斯占领
    '乌克兰':'https://zh.wikipedia.org/zh-cn/%E4%B9%8C%E5%85%8B%E5%85%B0%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #目前仅爬取人口前100城市
    '俄罗斯':'https://zh.wikipedia.org/zh-cn/%E4%BF%84%E7%BD%97%E6%96%AF%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #名称和图片杂糅
    #ul
    '匈牙利':'https://zh.wikipedia.org/zh-cn/%E5%8C%88%E7%89%99%E5%88%A9%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #tbody
    '捷克':'https://zh.wikipedia.org/zh-cn/%E6%8D%B7%E5%85%8B%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    '马来西亚':'https://zh.wikipedia.org/zh-cn/%E9%A9%AC%E6%9D%A5%E8%A5%BF%E4%BA%9A%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #复杂的城市定义
    '塞尔维亚':'https://zh.wikipedia.org/zh-cn/%E5%A1%9E%E7%88%BE%E7%B6%AD%E4%BA%9E%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #奇怪的数据组织方式
    #已爬
    '白俄罗斯':'https://zh.wikipedia.org/zh-cn/%E7%99%BD%E4%BF%84%E7%BD%97%E6%96%AF%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    '印度':'https://zh.wikipedia.org/zh-cn/%E5%8D%B0%E5%BA%A6%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    '中华人民共和国':'https://zh.wikipedia.org/zh-cn/%E4%B8%AD%E5%8D%8E%E4%BA%BA%E6%B0%91%E5%85%B1%E5%92%8C%E5%9B%BD%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    '韩国':'https://zh.wikipedia.org/zh-cn/%E9%9F%A9%E5%9B%BD%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    '日本':'https://zh.wikipedia.org/zh-cn/%E6%97%A5%E6%9C%AC%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    '越南':'https://zh.wikipedia.org/zh-cn/%E8%B6%8A%E5%8D%97%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    '加蓬':'https://zh.wikipedia.org/zh-cn/%E5%8A%A0%E8%93%AC%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    '埃塞俄比亚':'https://zh.wikipedia.org/zh-cn/%E5%9F%83%E5%A1%9E%E4%BF%84%E6%AF%94%E4%BA%9A%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #南非
    '南非':'https://zh.wikipedia.org/zh-cn/%E5%8D%97%E9%9D%9E%E8%87%AA%E6%B2%BB%E5%B8%82%E5%88%97%E8%A1%A8',
    #已爬，待修正
    '塞内加尔':'https://zh.wikipedia.org/zh-cn/%E5%A1%9E%E5%86%85%E5%8A%A0%E5%B0%94%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #ul 部分城市没有超链接
    '摩尔多瓦':'https://zh.wikipedia.org/zh-cn/%E6%91%A9%E7%88%BE%E5%A4%9A%E7%93%A6%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #只考虑了城市，没考虑城镇
    '拉脱维亚':'https://zh.wikipedia.org/zh-cn/%E6%8B%89%E8%84%B1%E7%BB%B4%E4%BA%9A%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #塞浦路斯：舍弃了乡镇信息
    '塞浦路斯':'https://zh.wikipedia.org/zh-cn/%E5%A1%9E%E6%B5%A6%E8%B7%AF%E6%96%AF%E5%9F%8E%E5%B8%82%E5%9F%8E%E9%95%87%E5%8F%8A%E6%9D%91%E5%BA%84%E5%88%97%E8%A1%A8',
    #只爬取了人口前20的城市信息
    '土耳其':'https://zh.wikipedia.org/zh-cn/%E5%9C%9F%E8%80%B3%E5%85%B6%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #图片杂糅在行列之间
    '沙特阿拉伯':'https://zh.wikipedia.org/zh-cn/%E6%B2%99%E7%89%B9%E9%98%BF%E6%8B%89%E4%BC%AF%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #内容固定在第一个td处
    '伊拉克':'https://zh.wikipedia.org/zh-cn/%E4%BC%8A%E6%8B%89%E5%85%8B%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #存在政治问题(未爬)
    '巴勒斯坦':'https://zh.wikipedia.org/zh-cn/%E7%B4%84%E6%97%A6%E6%B2%B3%E8%A5%BF%E5%B2%B8%E5%92%8C%E5%8A%A0%E6%B2%99%E5%9C%B0%E5%B8%B6%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #台湾地区的城市列表，需要补充到中华人民共和国城市列表
    #'中华民国':'https://zh.wikipedia.org/zh-cn/%E4%B8%AD%E8%8F%AF%E6%B0%91%E5%9C%8B%E8%87%BA%E7%81%A3%E5%9C%B0%E5%8D%80%E9%84%89%E9%8E%AE%E5%B8%82%E5%8D%80%E5%88%97%E8%A1%A8',
    
    #数据质量可能存在问题(未爬)
    '文莱':'https://zh.wikipedia.org/zh-cn/%E6%B1%B6%E8%90%8A%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',
    #已爬
    '贝宁':'https://zh.wikipedia.org/zh-cn/%E8%B4%9D%E5%AE%81%E5%9F%8E%E5%B8%82%E5%88%97%E8%A1%A8',#部分城市名字未做出标注
}

#城市列表缺失
missing = [
#拉丁美洲
'海地','格陵兰','波多黎各','圭亚那','哥斯达黎加','伯利兹','特立尼达和多巴哥',
'苏里南','巴巴多斯',
#欧洲
'北马其顿',
#亚洲
'科威特','马尔代夫','东帝汶',
#大洋洲
'新西兰','巴布新几内亚',
#非洲
'几内亚','布基纳法索','乍得','索马里','马里','塞拉利昂',
]

lost =[
    '南非','文莱'
]